Infineon/AURIX_code_examples/code_examples/OneEye_DAS_Oscilloscope_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HF_EER_Bits.PVERM */
#define IFX_DMU_HF_EER_PVERM_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_EER_Bits.PVERM */
#define IFX_DMU_HF_EER_PVERM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_EER_Bits.PVERM */
#define IFX_DMU_HF_EER_PVERM_OFF (3u)

/** \brief Length for Ifx_DMU_HF_EER_Bits.EVERM */
#define IFX_DMU_HF_EER_EVERM_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_EER_Bits.EVERM */
#define IFX_DMU_HF_EER_EVERM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_EER_Bits.EVERM */
#define IFX_DMU_HF_EER_EVERM_OFF (4u)

/** \brief Length for Ifx_DMU_HF_EER_Bits.EOBM */
#define IFX_DMU_HF_EER_EOBM_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_EER_Bits.EOBM */
#define IFX_DMU_HF_EER_EOBM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_EER_Bits.EOBM */
#define IFX_DMU_HF_EER_EOBM_OFF (31u)

/** \brief Length for Ifx_DMU_HF_ERRSR_Bits.OPER */
#define IFX_DMU_HF_ERRSR_OPER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ERRSR_Bits.OPER */
#define IFX_DMU_HF_ERRSR_OPER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ERRSR_Bits.OPER */
#define IFX_DMU_HF_ERRSR_OPER_OFF (0u)

/** \brief Length for Ifx_DMU_HF_ERRSR_Bits.SQER */
#define IFX_DMU_HF_ERRSR_SQER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ERRSR_Bits.SQER */
#define IFX_DMU_HF_ERRSR_SQER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ERRSR_Bits.SQER */
#define IFX_DMU_HF_ERRSR_SQER_OFF (1u)

/** \brief Length for Ifx_DMU_HF_ERRSR_Bits.PROER */
#define IFX_DMU_HF_ERRSR_PROER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ERRSR_Bits.PROER */
#define IFX_DMU_HF_ERRSR_PROER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ERRSR_Bits.PROER */
#define IFX_DMU_HF_ERRSR_PROER_OFF (2u)

/** \brief Length for Ifx_DMU_HF_ERRSR_Bits.PVER */
#define IFX_DMU_HF_ERRSR_PVER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ERRSR_Bits.PVER */
#define IFX_DMU_HF_ERRSR_PVER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ERRSR_Bits.PVER */
#define IFX_DMU_HF_ERRSR_PVER_OFF (3u)

/** \brief Length for Ifx_DMU_HF_ERRSR_Bits.EVER */
#define IFX_DMU_HF_ERRSR_EVER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ERRSR_Bits.EVER */
#define IFX_DMU_HF_ERRSR_EVER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ERRSR_Bits.EVER */
#define IFX_DMU_HF_ERRSR_EVER_OFF (4u)

/** \brief Length for Ifx_DMU_HF_ERRSR_Bits.ADER */
#define IFX_DMU_HF_ERRSR_ADER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ERRSR_Bits.ADER */
#define IFX_DMU_HF_ERRSR_ADER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ERRSR_Bits.ADER */
#define IFX_DMU_HF_ERRSR_ADER_OFF (5u)

/** \brief Length for Ifx_DMU_HF_ERRSR_Bits.ORIER */
#define IFX_DMU_HF_ERRSR_ORIER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ERRSR_Bits.ORIER */
#define IFX_DMU_HF_ERRSR_ORIER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ERRSR_Bits.ORIER */
#define IFX_DMU_HF_ERRSR_ORIER_OFF (6u)

/** \brief Length for Ifx_DMU_HF_CLRE_Bits.CSQER */
#define IFX_DMU_HF_CLRE_CSQER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_CLRE_Bits.CSQER */
#define IFX_DMU_HF_CLRE_CSQER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_CLRE_Bits.CSQER */
#define IFX_DMU_HF_CLRE_CSQER_OFF (1u)

/** \brief Length for Ifx_DMU_HF_CLRE_Bits.CPROER */
#define IFX_DMU_HF_CLRE_CPROER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_CLRE_Bits.CPROER */
#define IFX_DMU_HF_CLRE_CPROER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_CLRE_Bits.CPROER */
#define IFX_DMU_HF_CLRE_CPROER_OFF (2u)

/** \brief Length for Ifx_DMU_HF_CLRE_Bits.CPVER */
#define IFX_DMU_HF_CLRE_CPVER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_CLRE_Bits.CPVER */
#define IFX_DMU_HF_CLRE_CPVER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_CLRE_Bits.CPVER */
#define IFX_DMU_HF_CLRE_CPVER_OFF (3u)

/** \brief Length for Ifx_DMU_HF_CLRE_Bits.CEVER */
#define IFX_DMU_HF_CLRE_CEVER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_CLRE_Bits.CEVER */
#define IFX_DMU_HF_CLRE_CEVER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_CLRE_Bits.CEVER */
#define IFX_DMU_HF_CLRE_CEVER_OFF (4u)

/** \brief Length for Ifx_DMU_HF_CLRE_Bits.CADER */
#define IFX_DMU_HF_CLRE_CADER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_CLRE_Bits.CADER */
#define IFX_DMU_HF_CLRE_CADER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_CLRE_Bits.CADER */
#define IFX_DMU_HF_CLRE_CADER_OFF (5u)

/** \brief Length for Ifx_DMU_HF_ECCR_Bits.RCODE */
#define IFX_DMU_HF_ECCR_RCODE_LEN (22u)

/** \brief Mask for Ifx_DMU_HF_ECCR_Bits.RCODE */
#define IFX_DMU_HF_ECCR_RCODE_MSK (0x3fffffu)

/** \brief Offset for Ifx_DMU_HF_ECCR_Bits.RCODE */
#define IFX_DMU_HF_ECCR_RCODE_OFF (0u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.ERR1 */
#define IFX_DMU_HF_ECCS_ERR1_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.ERR1 */
#define IFX_DMU_HF_ECCS_ERR1_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.ERR1 */
#define IFX_DMU_HF_ECCS_ERR1_OFF (0u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.ERR2 */
#define IFX_DMU_HF_ECCS_ERR2_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.ERR2 */
#define IFX_DMU_HF_ECCS_ERR2_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.ERR2 */
#define IFX_DMU_HF_ECCS_ERR2_OFF (1u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.ERR3 */
#define IFX_DMU_HF_ECCS_ERR3_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.ERR3 */
#define IFX_DMU_HF_ECCS_ERR3_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.ERR3 */
#define IFX_DMU_HF_ECCS_ERR3_OFF (2u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.ERRM */
#define IFX_DMU_HF_ECCS_ERRM_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.ERRM */
#define IFX_DMU_HF_ECCS_ERRM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.ERRM */
#define IFX_DMU_HF_ECCS_ERRM_OFF (3u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.ERRANY */
#define IFX_DMU_HF_ECCS_ERRANY_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.ERRANY */
#define IFX_DMU_HF_ECCS_ERRANY_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.ERRANY */
#define IFX_DMU_HF_ECCS_ERRANY_OFF (7u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.BLANKA */
#define IFX_DMU_HF_ECCS_BLANKA_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.BLANKA */
#define IFX_DMU_HF_ECCS_BLANKA_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.BLANKA */
#define IFX_DMU_HF_ECCS_BLANKA_OFF (9u)

/** \brief Length for Ifx_DMU_HF_ECCS_Bits.AER1 */
#define IFX_DMU_HF_ECCS_AER1_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ECCS_Bits.AER1 */
#define IFX_DMU_HF_ECCS_AER1_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ECCS_Bits.AER1 */
#define IFX_DMU_HF_ECCS_AER1_OFF (16u)

