Infineon/AURIX_code_examples/code_examples/OneEye_DAS_Oscilloscope_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_SF_ECCS_Bits.AER3 */
#define IFX_DMU_SF_ECCS_AER3_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_ECCS_Bits.AER3 */
#define IFX_DMU_SF_ECCS_AER3_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_ECCS_Bits.AER3 */
#define IFX_DMU_SF_ECCS_AER3_OFF (18u)

/** \brief Length for Ifx_DMU_SF_ECCS_Bits.AERM */
#define IFX_DMU_SF_ECCS_AERM_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_ECCS_Bits.AERM */
#define IFX_DMU_SF_ECCS_AERM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_ECCS_Bits.AERM */
#define IFX_DMU_SF_ECCS_AERM_OFF (19u)

/** \brief Length for Ifx_DMU_SF_ECCS_Bits.AERANY */
#define IFX_DMU_SF_ECCS_AERANY_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_ECCS_Bits.AERANY */
#define IFX_DMU_SF_ECCS_AERANY_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_ECCS_Bits.AERANY */
#define IFX_DMU_SF_ECCS_AERANY_OFF (23u)

/** \brief Length for Ifx_DMU_SF_ECCS_Bits.ABLANKA */
#define IFX_DMU_SF_ECCS_ABLANKA_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_ECCS_Bits.ABLANKA */
#define IFX_DMU_SF_ECCS_ABLANKA_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_ECCS_Bits.ABLANKA */
#define IFX_DMU_SF_ECCS_ABLANKA_OFF (25u)

/** \brief Length for Ifx_DMU_SF_ECCC_Bits.CLR */
#define IFX_DMU_SF_ECCC_CLR_LEN (2u)

/** \brief Mask for Ifx_DMU_SF_ECCC_Bits.CLR */
#define IFX_DMU_SF_ECCC_CLR_MSK (0x3u)

/** \brief Offset for Ifx_DMU_SF_ECCC_Bits.CLR */
#define IFX_DMU_SF_ECCC_CLR_OFF (0u)

/** \brief Length for Ifx_DMU_SF_ECCC_Bits.ECCCORDIS */
#define IFX_DMU_SF_ECCC_ECCCORDIS_LEN (2u)

/** \brief Mask for Ifx_DMU_SF_ECCC_Bits.ECCCORDIS */
#define IFX_DMU_SF_ECCC_ECCCORDIS_MSK (0x3u)

/** \brief Offset for Ifx_DMU_SF_ECCC_Bits.ECCCORDIS */
#define IFX_DMU_SF_ECCC_ECCCORDIS_OFF (28u)

/** \brief Length for Ifx_DMU_SF_ECCC_Bits.TRAPDIS */
#define IFX_DMU_SF_ECCC_TRAPDIS_LEN (2u)

/** \brief Mask for Ifx_DMU_SF_ECCC_Bits.TRAPDIS */
#define IFX_DMU_SF_ECCC_TRAPDIS_MSK (0x3u)

/** \brief Offset for Ifx_DMU_SF_ECCC_Bits.TRAPDIS */
#define IFX_DMU_SF_ECCC_TRAPDIS_OFF (30u)

/** \brief Length for Ifx_DMU_SF_ECCW_Bits.WCODE */
#define IFX_DMU_SF_ECCW_WCODE_LEN (22u)

/** \brief Mask for Ifx_DMU_SF_ECCW_Bits.WCODE */
#define IFX_DMU_SF_ECCW_WCODE_MSK (0x3fffffu)

/** \brief Offset for Ifx_DMU_SF_ECCW_Bits.WCODE */
#define IFX_DMU_SF_ECCW_WCODE_OFF (0u)

/** \brief Length for Ifx_DMU_SF_ECCW_Bits.ECCENCDIS */
#define IFX_DMU_SF_ECCW_ECCENCDIS_LEN (2u)

/** \brief Mask for Ifx_DMU_SF_ECCW_Bits.ECCENCDIS */
#define IFX_DMU_SF_ECCW_ECCENCDIS_MSK (0x3u)

/** \brief Offset for Ifx_DMU_SF_ECCW_Bits.ECCENCDIS */
#define IFX_DMU_SF_ECCW_ECCENCDIS_OFF (30u)

/** \brief Length for Ifx_DMU_SF_PROCONUSR_Bits.MODE */
#define IFX_DMU_SF_PROCONUSR_MODE_LEN (2u)

/** \brief Mask for Ifx_DMU_SF_PROCONUSR_Bits.MODE */
#define IFX_DMU_SF_PROCONUSR_MODE_MSK (0x3u)

/** \brief Offset for Ifx_DMU_SF_PROCONUSR_Bits.MODE */
#define IFX_DMU_SF_PROCONUSR_MODE_OFF (0u)

/** \brief Length for Ifx_DMU_SF_SUSPEND_Bits.REQ */
#define IFX_DMU_SF_SUSPEND_REQ_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_SUSPEND_Bits.REQ */
#define IFX_DMU_SF_SUSPEND_REQ_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_SUSPEND_Bits.REQ */
#define IFX_DMU_SF_SUSPEND_REQ_OFF (0u)

/** \brief Length for Ifx_DMU_SF_SUSPEND_Bits.CLR */
#define IFX_DMU_SF_SUSPEND_CLR_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_SUSPEND_Bits.CLR */
#define IFX_DMU_SF_SUSPEND_CLR_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_SUSPEND_Bits.CLR */
#define IFX_DMU_SF_SUSPEND_CLR_OFF (1u)

/** \brief Length for Ifx_DMU_SF_SUSPEND_Bits.SPND */
#define IFX_DMU_SF_SUSPEND_SPND_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_SUSPEND_Bits.SPND */
#define IFX_DMU_SF_SUSPEND_SPND_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_SUSPEND_Bits.SPND */
#define IFX_DMU_SF_SUSPEND_SPND_OFF (16u)

/** \brief Length for Ifx_DMU_SF_SUSPEND_Bits.ERR */
#define IFX_DMU_SF_SUSPEND_ERR_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_SUSPEND_Bits.ERR */
#define IFX_DMU_SF_SUSPEND_ERR_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_SUSPEND_Bits.ERR */
#define IFX_DMU_SF_SUSPEND_ERR_OFF (17u)

/** \brief Length for Ifx_DMU_SF_MARGIN_Bits.SELD1 */
#define IFX_DMU_SF_MARGIN_SELD1_LEN (2u)

/** \brief Mask for Ifx_DMU_SF_MARGIN_Bits.SELD1 */
#define IFX_DMU_SF_MARGIN_SELD1_MSK (0x3u)

/** \brief Offset for Ifx_DMU_SF_MARGIN_Bits.SELD1 */
#define IFX_DMU_SF_MARGIN_SELD1_OFF (0u)

/** \brief Length for Ifx_DMU_SF_MARGIN_Bits.HMARGIN */
#define IFX_DMU_SF_MARGIN_HMARGIN_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_MARGIN_Bits.HMARGIN */
#define IFX_DMU_SF_MARGIN_HMARGIN_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_MARGIN_Bits.HMARGIN */
#define IFX_DMU_SF_MARGIN_HMARGIN_OFF (8u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMBOOTEN */
#define IFX_DMU_SP_PROCONHSMCFG_HSMBOOTEN_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMBOOTEN */
#define IFX_DMU_SP_PROCONHSMCFG_HSMBOOTEN_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMBOOTEN */
#define IFX_DMU_SP_PROCONHSMCFG_HSMBOOTEN_OFF (0u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCFG_Bits.SSWWAIT */
#define IFX_DMU_SP_PROCONHSMCFG_SSWWAIT_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCFG_Bits.SSWWAIT */
#define IFX_DMU_SP_PROCONHSMCFG_SSWWAIT_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCFG_Bits.SSWWAIT */
#define IFX_DMU_SP_PROCONHSMCFG_SSWWAIT_OFF (1u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMDX */
#define IFX_DMU_SP_PROCONHSMCFG_HSMDX_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMDX */
#define IFX_DMU_SP_PROCONHSMCFG_HSMDX_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMDX */
#define IFX_DMU_SP_PROCONHSMCFG_HSMDX_OFF (2u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMRAMKEEP */
#define IFX_DMU_SP_PROCONHSMCFG_HSMRAMKEEP_LEN (2u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMRAMKEEP */
#define IFX_DMU_SP_PROCONHSMCFG_HSMRAMKEEP_MSK (0x3u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMRAMKEEP */
#define IFX_DMU_SP_PROCONHSMCFG_HSMRAMKEEP_OFF (4u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMENPINS */
#define IFX_DMU_SP_PROCONHSMCFG_HSMENPINS_LEN (2u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMENPINS */
#define IFX_DMU_SP_PROCONHSMCFG_HSMENPINS_MSK (0x3u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMENPINS */
#define IFX_DMU_SP_PROCONHSMCFG_HSMENPINS_OFF (7u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMENRES */
#define IFX_DMU_SP_PROCONHSMCFG_HSMENRES_LEN (2u)

